antonkarseev/da1470x_demo_vscode/SDK-10.2.6.49/sdk/bsp/include/sdk_defs.h
/**
 * \addtogroup PLA_BSP_SYSTEM
 * \{
 * \addtogroup BSP_DEFINITIONS SDK Platform Definitions
 *
 * \brief Platform definitions
 *
 * \{
 */

/**
 ****************************************************************************************
 *
 * @file sdk_defs.h
 *
 * @brief Central include header file with platform definitions.
 *
 * Copyright (C) 2015-2022 Dialog Semiconductor.
 * This computer program includes Confidential, Proprietary Information
 * of Dialog Semiconductor. All Rights Reserved.
 *
 ****************************************************************************************
 */

#ifndef __SDK_DEFS_H__
#define __SDK_DEFS_H__

#include <stddef.h>

#ifdef __cplusplus
 extern "C" {
#endif

#ifdef __GNUC__
#  define GCC_VERSION (__GNUC__ * 10000 \
                               + __GNUC_MINOR__ * 100 \
                               + __GNUC_PATCHLEVEL__)
/* assert gcc version is at least 4.9.3 */
#  if GCC_VERSION < 40903
#    error "Please use gcc version 4.9.3 or newer!"
#  endif
#endif

#     include "DA1470x-00.h"



#include "system_DA1470x.h"                         /* DA1470x System                                                      */

/************************
 * Memory map
 ************************/

/**
 * \brief Remapped device base address.
 */
#define MEMORY_REMAPPED_BASE    0x00000000UL
#define MEMORY_REMAPPED_END     0x00800000UL

/**
 * \brief Remapped device memory size.
 */
#define MEMORY_REMAPPED_SIZE    (MEMORY_REMAPPED_END - MEMORY_REMAPPED_BASE)

/**
 * \brief ROM base address.
 */
#define MEMORY_ROM_BASE         0x0F020000UL
#define MEMORY_ROM_END          (MEMORY_ROM_BASE + 0x10000UL)

/**
 * \brief ROM memory size.
 */
#define MEMORY_ROM_SIZE         (MEMORY_ROM_END - MEMORY_ROM_BASE)

/**
 * \brief OTP memory base address.
 */
#define MEMORY_OTP_BASE         0x10080000UL
#define MEMORY_OTP_END          0x10090000UL
 /* Peripheral remap */
#define MEMORY_OTP_BASE_P       0x30080000UL
#define MEMORY_OTP_END_P        0x30090000UL

/**
 * \brief OTP memory size.
 */
#define MEMORY_OTP_SIZE         (MEMORY_OTP_END - MEMORY_OTP_BASE)

/**
 * \brief SYSTEM RAM base address.
 */
#define MEMORY_SYSRAM_BASE      (0x20000000UL)
#define MEMORY_SYSRAM3_BASE     (0x20010000UL)
#define MEMORY_SYSRAM8_BASE     (0x20110000UL)
#define MEMORY_SYSRAM9_BASE     (0x20130000UL)
#define MEMORY_SYSRAM10_BASE    (0x20150000UL)
#define MEMORY_SYSRAM11_BASE    (0x20180000UL)
#define MEMORY_SYSRAM_END       (0x20180000UL)

/**
 * \brief SYSTEM RAM size.
 */
#define MEMORY_SYSRAM_SIZE      (MEMORY_SYSRAM_END - MEMORY_SYSRAM_BASE)

/**
 * \brief CACHE RAM base address.
 */
#define MEMORY_CACHERAM_BASE    0x10068000UL
#define MEMORY_CACHERAM_END     0x1006A000UL

/**
 * \brief CACHE RAM size.
 */
#define MEMORY_CACHERAM_SIZE    (MEMORY_CACHERAM_END - MEMORY_CACHERAM_BASE)

/**
 * \brief QSPI Flash base address.
 */

 /*
  * OQSPIC (octa/quad-SPI) AHB-C(ode) bus (cached). Accesses through this bus
  * are restricted according to CACHE_FLASH_REG.
  */
#define MEMORY_OQSPIC_BASE      (0x18000000UL)
#define MEMORY_OQSPIC_END       (MEMORY_OQSPIC_BASE + 0x8000000UL)
 /*
  * OQSPIC (octa-SPI) AHB-S(ystem) bus (Not cached). Accesses through this bus
  * are not affected by CACHE_FLASH_REG.
  */
#define MEMORY_OQSPIC_S_BASE    (0x38000000UL)
#define MEMORY_OQSPIC_S_END     (MEMORY_OQSPIC_S_BASE + 0x8000000UL)

/*
 * QSPIC (typically for a second external flash, not cached, non-XiP)
 */
#define MEMORY_QSPIC_BASE       (0x48000000UL)
#define MEMORY_QSPIC_END        (MEMORY_QSPIC_BASE + 0x8000000UL)

/*
 * QSPIC2 (typically for an external PSRAM, cached through DCACHE)
 */
#define MEMORY_QSPIC2_BASE       (0x28000000UL)
#define MEMORY_QSPIC2_END        (MEMORY_QSPIC2_BASE + 0x8000000UL)


/*
* DCACHE controller
*/
#define MEMORY_DCACHE_BASE       (0x30104000UL)
#define MEMORY_DCACHE_SIZE       (0x4000UL)
#define MEMORY_DCACHE_END        (MEMORY_DCACHE_BASE + MEMORY_DCACHE_SIZE)


/**
 * \brief OQSPIC memory size.
 */
#define MEMORY_OQSPIC_SIZE      (MEMORY_OQSPIC_S_END - MEMORY_OQSPIC_S_BASE)

/**
 * \brief QSPIC memory size.
 */

#define MEMORY_QSPIC_SIZE       (MEMORY_QSPIC_END - MEMORY_QSPIC_BASE)

/**
 * \brief QSPIC2 memory size.
 */
#define MEMORY_QSPIC2_SIZE      (MEMORY_QSPIC2_END - MEMORY_QSPIC2_BASE)

/*
 * Primary product header location
 */
#if defined(NVMS_PRODUCT_HEADER_PART_START)
/*
 * Product header location according to the partition table definitions
 */
#define PRIMARY_PRODUCT_HEADER_BASE     (NVMS_PRODUCT_HEADER_PART_START)
#else
 /*
  * User-defined location of the product headers.
  */
#define PRIMARY_PRODUCT_HEADER_BASE     (0x0000)
#endif

/*
 * Backup product header location
 */
#define BACKUP_PRODUCT_HEADER_BASE      (PRIMARY_PRODUCT_HEADER_BASE + 0x1000)


/**
 * \brief TRNG FIFO address
 */



/**
 * \brief OTP User Data Encryption Keys memory base address
 */
#define MEMORY_OTP_USER_DATA_KEYS_PAYLOAD_START         0x00000A00UL
#define MEMORY_OTP_USER_DATA_KEYS_PAYLOAD_END           0x00000B00UL
#define MEMORY_OTP_USER_DATA_KEYS_INDEX_START           0x000009C0UL
#define MEMORY_OTP_USER_DATA_KEYS_INDEX_END             0x000009E0UL


#define WITHIN_RANGE(_a, _s, _e)        (((uint32_t)(_a) >= (uint32_t)(_s)) && ((uint32_t)(_a) < (uint32_t)(_e)))

/**
 * \brief Address is in the remapped memory region
 */
#define IS_REMAPPED_ADDRESS(_a)         WITHIN_RANGE((_a), MEMORY_REMAPPED_BASE, MEMORY_REMAPPED_END)

/**
 * \brief Address is in the ROM region
 */
#define IS_ROM_ADDRESS(_a)              WITHIN_RANGE((_a), MEMORY_ROM_BASE, MEMORY_ROM_END)

/**
 * \brief Address is in the OTP memory region
 */
#define IS_OTP_ADDRESS(_a)              WITHIN_RANGE((_a), MEMORY_OTP_BASE, MEMORY_OTP_END) || \
                                        WITHIN_RANGE((_a), MEMORY_OTP_BASE_P, MEMORY_OTP_END_P )
/**
 * \brief Address is in the SYSTEM RAM region
 */
#define IS_SYSRAM_ADDRESS(_a)           WITHIN_RANGE((_a), MEMORY_SYSRAM_BASE, MEMORY_SYSRAM_END)

/**
 * \brief Address is in the CACHE RAM region
 */
#define IS_CACHERAM_ADDRESS(_a)         WITHIN_RANGE((_a), MEMORY_CACHERAM_BASE, MEMORY_CACHERAM_END)



/**
 * \brief Address is in the octa-SPI Flash memory region
 */
#define IS_OQSPIC_ADDRESS(_a)           WITHIN_RANGE((_a), MEMORY_OQSPIC_BASE, MEMORY_OQSPIC_END)

/**
* \brief Address is in the octa-SPI AHB-S(ystem) memory region
*/
#define IS_OQSPIC_S_ADDRESS(_a)         WITHIN_RANGE((_a), MEMORY_OQSPIC_S_BASE, MEMORY_OQSPIC_S_END)

/**
* \brief Address is in the QSPI AHB-S(ystem) memory region
*/
#define IS_QSPIC_ADDRESS(_a)            WITHIN_RANGE((_a), MEMORY_QSPIC_BASE, MEMORY_QSPIC_END)

/**
* \brief Address is in the QSPI2 AHB-S(ystem) memory region
*/
#define IS_QSPIC2_ADDRESS(_a)           WITHIN_RANGE((_a), MEMORY_QSPIC2_BASE, MEMORY_QSPIC2_END)

/**
 * \brief Address is in OQSPI_MEM1 virtual memory region
 */
#define IS_OQSPI_MEM1_VIRTUAL_ADDRESS(_a)       WITHIN_RANGE((_a), OQSPI_MEM1_VIRTUAL_BASE_ADDR,                        \
                                                                  (OQSPI_MEM1_VIRTUAL_BASE_ADDR + MEMORY_OQSPIC_SIZE))
/**
 * \brief Address is in QSPI_MEM1 virtual memory region
 */
#define IS_QSPI_MEM1_VIRTUAL_ADDRESS(_a)        WITHIN_RANGE((_a), QSPI_MEM1_VIRTUAL_BASE_ADDR,                         \
                                                                  (QSPI_MEM1_VIRTUAL_BASE_ADDR + MEMORY_QSPIC_SIZE))
/**
 * \brief Address is in QSPI_MEM2 virtual memory region
 */
#define IS_QSPI_MEM2_VIRTUAL_ADDRESS(_a)        WITHIN_RANGE((_a), QSPI_MEM2_VIRTUAL_BASE_ADDR,                         \
                                                                  (QSPI_MEM2_VIRTUAL_BASE_ADDR + MEMORY_QSPIC2_SIZE))
/**
 * \brief Check if the current build has cached flash configuration enabled
 */
#define IS_CACHED_FLASH                         ((dg_configCODE_LOCATION == NON_VOLATILE_IS_OQSPI_FLASH) && \
                                                 (dg_configEXEC_MODE == MODE_IS_CACHED))

 /**
 * \brief The Sector Size of the OQSPI and QSPI flash memories
 */
 #define FLASH_SECTOR_SIZE              (0x1000)


 /**
  * \brief The base address for accessing the Flash memory connected to OQSPI
  *
  * The base address is used in oqspi_automode. Automode is using a single zero-based address region
  * for accessing the Flash devices connected to OQSPI and both QSPI controllers (OQSPIC, QSPIC and QSPIC2).
  * The defined address sub-regions are:
  *    Address region 1: OQSPI_MEM1_VIRTUAL_BASE_ADDR..QSPI_MEM1_VIRTUAL_BASE_ADDR-1
  *    Address region 2: QSPI_MEM1_VIRTUAL_BASE_ADDR..QSPI_MEM2_VIRTUAL_BASE_ADDR-1
  *    Address region 3: starting at QSPI_MEM2_VIRTUAL_BASE_ADDR
  * When Flash address is in region 1 then the device connected to OQSPIC is accessed.
  * When Flash address is in region 2 then the device connected to QSPIC is accessed.
  * When Flash address is in region 3 then the device connected to QSPIC2 is accessed.
  * The maximum region size handled by each QSPI controller in automode is 128MBytes.
  * The default value of each region size is 0x8000000, allowing 128MBytes region
  * for each controller.
  */
 #ifndef OQSPI_MEM1_VIRTUAL_BASE_ADDR
 #define OQSPI_MEM1_VIRTUAL_BASE_ADDR                (0x00000000)
 #endif

 /**
  * \brief The base address for accessing the Flash memory connected to QSPIC
  *
  * The base address is used in qspi_automode.
  */
 #ifndef QSPI_MEM1_VIRTUAL_BASE_ADDR
 #define QSPI_MEM1_VIRTUAL_BASE_ADDR                 (OQSPI_MEM1_VIRTUAL_BASE_ADDR + MEMORY_OQSPIC_SIZE)
 #endif

 /**
  * \brief The base address for accessing the Flash memory connected to QSPIC2
  *
  * The base address is used in qspi_automode.
  */
 #ifndef QSPI_MEM2_VIRTUAL_BASE_ADDR
 #define QSPI_MEM2_VIRTUAL_BASE_ADDR                 (QSPI_MEM1_VIRTUAL_BASE_ADDR + MEMORY_QSPIC_SIZE)
 #endif


/**
 * \brief Zero-initialized data retained memory attribute
 */
#define __RETAINED                      __attribute__((section("retention_mem_zi")))    // RetRAM0
#define __RETAINED_1                    __attribute__((section("retention_mem_1_zi")))  // RetRAM1

/**
 * \brief Initialized data retained memory attribute
 */
#define __RETAINED_RW                   __attribute__((section("retention_mem_init")))

/**
 * \brief Uninitialized data retained memory attribute. Used for variables that should
 * not be initialized during startup.
 */
#define __RETAINED_UNINIT               __attribute__((section("retention_mem_uninit")))

 /**
  * \brief Constant data retained memory attribute
  */
#define __RETAINED_CONST_INIT           __attribute__((section("retention_mem_const")))

/**
 * \brief Zero-initialized data retained memory attribute visible by CMAC and SNC
 */
#define __RETAINED_SHARED               __attribute__((section("retention_mem_shared_zi")))

/**
 * \brief Text retained memory attribute
 */
# if ((dg_configCODE_LOCATION == NON_VOLATILE_IS_OQSPI_FLASH) && (dg_configEXEC_MODE == MODE_IS_CACHED))
# define __RETAINED_CODE                __attribute__((section("text_retained"))) __attribute__((noinline)) __attribute__((optimize ("no-tree-switch-conversion")))
# else
# define __RETAINED_CODE
# endif

