antonkarseev/da1470x_demo_vscode/SDK-10.2.6.49/sdk/bsp/include/sdk_defs.h
# if dg_configRETAIN_HOT_CODE
# define __RETAINED_HOT_CODE             __RETAINED_CODE
# else
# define __RETAINED_HOT_CODE
# endif


# if (dg_configSTORE_VARIABLES_TO_EXTERNAL_RAM == 1)
/**
  * \brief Uninitialized data external memory attribute.
  *        Used for uninitialized variables which should be placed in external RAM (PSRAM).
  */
# define __EXTERNAL_MEM_UNINIT          __attribute__((section("external_mem_uninit")))
#endif

#if (__RAM9_SIZE_FOR_MAIN_PROC > 0)
/**
 * \brief Attribute for data to be placed in RAM9
 * (which has slower access times for the MAIN PROCESSOR)
 */
# define __IN_CMAC_MEM2                 __attribute__((section("m33_data_in_ram9")))

/**
 * \brief Attribute for uninitialized data to be placed in RAM9
 * (which has slower access times for the MAIN PROCESSOR)
 */
# define __IN_CMAC_MEM2_UNINIT          __attribute__((section("m33_uninit_data_in_ram9")))
#endif

#if (__RAM10_SIZE_FOR_MAIN_PROC > 0)
/**
 * \brief Attribute for data to be placed in RAM10
 * (which has slower access times for the MAIN PROCESSOR)
 */
# define __IN_CMAC_MEM1                 __attribute__((section("m33_data_in_ram10")))

/**
 * \brief Attribute for uninitialized data to be placed in RAM10
 * (which has slower access times for the MAIN PROCESSOR)
 */
# define __IN_CMAC_MEM1_UNINIT          __attribute__((section("m33_uninit_data_in_ram10")))
#endif



/**
 * \brief Attribute to silence warnings about unused parameters/variables/function
 */
#define __UNUSED                __attribute__((unused))

/**
 * \brief Attribute to tell the compiler to consider a symbol as externally visible (for LTO)
 */
#define __LTO_EXT               __attribute__((externally_visible))

 /**
  * \brief Macro to silence warnings about unused function arguments
  *
  * \param[in] x         The variable name
  */
#define UNUSED_ARG(x)          (void)(x)

typedef void (*assertion_func_t)(void* args);
extern assertion_func_t assert_warning_func;
extern assertion_func_t assert_error_func;
void assertion_functions_set_to_uninit(void);
void assertion_functions_set_to_init(void);

/* Push registers on stack */
#define __PUSH_SCRATCH_REGISTERS()                                                                      \
        do {                                                                                            \
                __ASM volatile (                                                                        \
                        "  .syntax unified              \n"     /* Prevent non-unified syntax */        \
                        "   push {r0, r1, r2, r3}       \n"     /* Push scratch registers on stack. */  \
                        :                                       /* Output operands: None */             \
                        :                                       /* Input operands: None */              \
                        :                                       /* Clobbers: None */                    \
                );                                                                                      \
        } while (0)

/* Get the value of the stack pointer */
#define __get_SP()                                                                              \
({                                                                                              \
  uint32_t ret;                                                                                 \
                                                                                                \
  __ASM volatile (                                                                              \
          "  .syntax unified    \n"     /* Prevent non-unified syntax */                        \
          "   mov %[ret], sp    \n"     /* Move SP value on a general purpose register . */     \
          :   [ret]"=r" (ret)           /* Output operands: Store the SP value on ret */        \
          :                             /* Input operands: None */                              \
          :                             /* Clobbers: None */                                    \
  );                                                                                            \
  ret;                                                                                          \
})

/**
 * \brief Assert as warning macro
 *
 * \note Active only while in development mode
 */
 #define ASSERT_WARNING(a) if (!(a)) {                                                          \
                                 if (dg_configIMAGE_SETUP == DEVELOPMENT_MODE) {                \
                                         __PUSH_SCRATCH_REGISTERS();                            \
                                         assert_warning_func((void *)__get_SP());               \
                                 }                                                              \
                           }



/**
 * \brief Assert as error macro
 *
 */
#define ASSERT_ERROR(a) if (!(a)) {                                                            \
                                if (dg_configIMAGE_SETUP == DEVELOPMENT_MODE) {                \
                                        __PUSH_SCRATCH_REGISTERS();                            \
                                        assert_warning_func((void *)__get_SP());               \
                                } else {                                                       \
                                        assert_error_func(0);                                  \
                                }                                                              \
                        }


/**
 * \brief Macro to disable all interrupts
 *
 * This macro must always be used with GLOBAL_INT_RESTORE(). E.g.
 *
 * \code{.c}
 * GLOBAL_INT_DISABLE();
 *  ... code to be executed with interrupts disabled ...
 * GLOBAL_INT_RESTORE();
 * \endcode
 *
 * \sa GLOBAL_INT_RESTORE
 */
#define GLOBAL_INT_DISABLE()                                                            \
        do {                                                                            \
                unsigned int __l_irq_rest;                                              \
                __ASM volatile ("mrs   %0, primask  \n\t"                               \
                              "mov   r1, $1     \n\t"                                   \
                              "msr   primask, r1  \n\t"                                 \
                              : "=r" (__l_irq_rest)                                     \
                              :                                                         \
                              : "r1"                                                    \
                              );                                                        \
               DBG_CONFIGURE_HIGH(CMN_TIMING_DEBUG, CMNDBG_CRITICAL_SECTION);

/**
 * \brief Macro to restore all interrupts
 *
 * This macro must always be used after GLOBAL_INT_DISABLE(). E.g.
 *
 * \code{.c}
 * GLOBAL_INT_DISABLE();
 *  ... code to be executed with interrupts disabled ...
 * GLOBAL_INT_RESTORE();
 * \endcode
 *
 * \sa GLOBAL_INT_DISABLE
 */
#define GLOBAL_INT_RESTORE()                                                            \
                if (__l_irq_rest == 0) {                                                \
                        DBG_CONFIGURE_LOW(CMN_TIMING_DEBUG, CMNDBG_CRITICAL_SECTION);   \
                }                                                                       \
                __ASM volatile ("msr   primask, %0  \n\t"                               \
                                                          :                             \
                                                          : "r" (__l_irq_rest)          \
                                                          :                             \
                                                          );                            \
        } while (0)

